Tekla Open API Reference for Tekla Structures 2025
WpfSaveLoad.UserDefinedHelpFilePath Property
 Gets or sets the file path where the UserDefined help file is located. If you do not provide a UserDefinedHelpFilePath, the general Help file, help.chm, will be displayed.
 Namespace: Tekla.Structures.Dialog.UIControls
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public string UserDefinedHelpFilePath { get; set; }
Public Property UserDefinedHelpFilePath As String
	Get
	Set
Property Value
Type: String
See Also
Reference
WpfSaveLoad Class
Tekla.Structures.Dialog.UIControls Namespace